export const posts = [
  {
    imageSrc:
      "https://img.freepik.com/premium-vector/red-fake-stamp-sticker-with-grunge-vector-illustration_723710-539.jpg",
    imageAlt: "alt",
    theme: "Front-end",
    date: new Date(2025, 10, 12),
    title: "Как работать с CSS Grid",
    text: "На заре веба для создания раскладки поинтереснее одноколоночной часто использовались таблицы. Но проблема была в том, что таблицы были сделаны не для этого. Даже если отбросить семантическую нагруженность этого элемента, отдельные свойства для стилизации были крайне неудобными. По сути, это был костыль за неимением более удобных способов. Гриды же изначально были придуманы и реализованы как инструмент для создания раскладки.",
    readTime: 5,
    likesCount: 23,
    href: "#",
  },
  {
    imageSrc:
      "https://img.freepik.com/premium-vector/red-fake-stamp-sticker-with-grunge-vector-illustration_723710-539.jpg",
    imageAlt: "alt",
    theme: "Front-end",
    date: new Date(2025, 10, 12),
    title: "Как работать с CSS Grid 1",
    text: "На заре веба для создания раскладки поинтереснее одноколоночной часто использовались таблицы. Но проблема была в том, что таблицы были сделаны не для этого. Даже если отбросить семантическую нагруженность этого элемента, отдельные свойства для стилизации были крайне неудобными. По сути, это был костыль за неимением более удобных способов. Гриды же изначально были придуманы и реализованы как инструмент для создания раскладки.",
    readTime: 5,
    likesCount: 23,
    href: "#",
  },
  {
    imageSrc:
      "https://img.freepik.com/premium-vector/red-fake-stamp-sticker-with-grunge-vector-illustration_723710-539.jpg",
    imageAlt: "alt",
    theme: "Front-end",
    date: new Date(2025, 10, 12),
    title: "Как работать с CSS Grid 2",
    text: "На заре веба для создания раскладки поинтереснее одноколоночной часто использовались таблицы. Но проблема была в том, что таблицы были сделаны не для этого. Даже если отбросить семантическую нагруженность этого элемента, отдельные свойства для стилизации были крайне неудобными. По сути, это был костыль за неимением более удобных способов. Гриды же изначально были придуманы и реализованы как инструмент для создания раскладки.",
    readTime: 5,
    likesCount: 23,
    href: "#",
  },
  {
    imageSrc:
      "https://img.freepik.com/premium-vector/red-fake-stamp-sticker-with-grunge-vector-illustration_723710-539.jpg",
    imageAlt: "alt",
    theme: "Front-end",
    date: new Date(2025, 10, 12),
    title: "Как работать с CSS Grid 3",
    text: "На заре веба для создания раскладки поинтереснее одноколоночной часто использовались таблицы. Но проблема была в том, что таблицы были сделаны не для этого. Даже если отбросить семантическую нагруженность этого элемента, отдельные свойства для стилизации были крайне неудобными. По сути, это был костыль за неимением более удобных способов. Гриды же изначально были придуманы и реализованы как инструмент для создания раскладки.",
    readTime: 5,
    likesCount: 23,
    href: "#",
  },
  {
    imageSrc:
      "https://img.freepik.com/premium-vector/red-fake-stamp-sticker-with-grunge-vector-illustration_723710-539.jpg",
    imageAlt: "alt",
    theme: "Front-end",
    date: new Date(2025, 10, 12),
    title: "Как работать с CSS Grid 4",
    text: "На заре веба для создания раскладки поинтереснее одноколоночной часто использовались таблицы. Но проблема была в том, что таблицы были сделаны не для этого. Даже если отбросить семантическую нагруженность этого элемента, отдельные свойства для стилизации были крайне неудобными. По сути, это был костыль за неимением более удобных способов. Гриды же изначально были придуманы и реализованы как инструмент для создания раскладки.",
    readTime: 5,
    likesCount: 23,
    href: "#",
  },
  {
    imageSrc:
      "https://img.freepik.com/premium-vector/red-fake-stamp-sticker-with-grunge-vector-illustration_723710-539.jpg",
    imageAlt: "alt",
    theme: "Front-end",
    date: new Date(2025, 10, 12),
    title: "Как работать с CSS Grid 5",
    text: "На заре веба для создания раскладки поинтереснее одноколоночной часто использовались таблицы. Но проблема была в том, что таблицы были сделаны не для этого. Даже если отбросить семантическую нагруженность этого элемента, отдельные свойства для стилизации были крайне неудобными. По сути, это был костыль за неимением более удобных способов. Гриды же изначально были придуманы и реализованы как инструмент для создания раскладки.",
    readTime: 5,
    likesCount: 23,
    href: "#",
  },
];
